Repository: dotnet/interactive-window
Catalog: src/Microsoft.VisualStudio.InteractiveWindow/xlf/InteractiveWindowResources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# ResetCommandDescription
source: Reset the execution environment to the initial state, keep history.
cs: Obnoví původní stav spouštěcího prostředí, zachová historii.
de: Setzt die Ausführungsumgebung in den ursprünglichen Zustand zurück. Der Verlauf wird beibehalten.
es: Restablecer el entorno de ejecución al estado inicial, conservar el historial.
fr: Rétablir l'état initial de l'environnement d'exécution, conserver l'historique.
it: Ripristina lo stato iniziale dell'ambiente di esecuzione, mantenendo la cronologia.
ja: 実行環境を初期状態にリセットし、履歴を保持します。
pl: Przywróć początkowy stan środowiska wykonawczego, zachowując historię.
pt_br: Redefina o ambiente de execução para o estado inicial e mantenha o histórico.
ru: Сброс окружения выполнения до первоначального состояния с сохранением журнала.
tr: Yürütme ortamını ilk durumuna sıfırlayın, geçmişi saklayın.
zh_hans: 将执行环境重置为初始状态，保留历史记录。
zh_hant: 將執行環境重設為初始狀態，但保留記錄。

# ResetCommandParametersDescription
source: Reset to a clean environment (only mscorlib referenced), do not run initialization script.
cs: Obnoví čisté prostředí (jenom s odkazem na mscorlib), nespustí inicializační skript.
de: Setzt auf eine saubere Umgebung zurück (nur Verweis auf "mscorlib") und führt das Initialisierungsskript nicht aus.
es: Restablecer a un entorno limpio (referencia exclusiva a mscorlib), no ejecutar el script de inicialización.
fr: Rétablir un environnement propre (seul mscorlib est référencé), ne pas exécuter de script d'initialisation.
it: Esegue il ripristino a un ambiente pulito (solo con riferimenti a mscorlib), senza eseguire lo script di inizializzazione.
ja: クリーンな環境 (mscorlib のみを参照) にリセットし、初期化スクリプトは実行しません。
pl: Przywróć czyste środowisko (tylko z odwołaniem do elementu mscorlib), nie uruchamiaj skryptu inicjowania.
pt_br: Redefina para um ambiente limpo (apenas mscorlib referenciado) e não execute o script de inicialização.
ru: Сброс до состояния чистого окружения (есть только ссылка на mscorlib) без запуска скрипта инициализации.
tr: Temiz bir ortama sıfırlayın (yalnızca mscorlib öğesine başvurulur), başlatma betiğini çalıştırmayın.
zh_hans: 重置为干净环境(仅引用 mscorlib)，不要运行初始化脚本。
zh_hant: 重設為初始環境 (僅參考 mscorlib)，不要執行初始化指令碼。

# ShiftEnterHelp
source: Insert a new line.
cs: Vloží nový řádek.
de: Fügt eine neue Zeile ein.
es: Inserte una nueva línea.
fr: Insérer une nouvelle ligne.
it: Inserisce una nuova riga.
ja: 新しい行を挿入します。
pl: Wstaw nowy wiersz.
pt_br: Insira uma nova linha.
ru: Вставка новой строки.
tr: Yeni bir satır ekleyin.
zh_hans: 插入新行。
zh_hant: 插入新行。

# UnknownCommand
source: Unknown command '{0}'
cs: Neznámý příkaz {0}
de: Unbekannter Befehl "{0}".
es: Comando '{0}' desconocido.
fr: Commande inconnue '{0}'
it: Comando '{0}' sconosciuto
ja: '{0}' は不明なコマンドです
pl: Nieznane polecenie „{0}”
pt_br: Comando desconhecido '{0}'
ru: Неизвестная команда "{0}".
tr: Bilinmeyen komut '{0}'
zh_hans: 未知命令“{0}”
zh_hant: 未知的命令 '{0}'

# UpArrowHelp1
source: At the end of the current submission, replace the current submission with a previous submission.
cs: Na konci aktuálního odeslání nahradí aktuální odeslání předchozím odesláním.
de: Ersetzt am Ende der aktuellen Übermittlung die aktuelle Übermittlung durch eine vorherige Übermittlung.
es: Al final del envío actual, reemplace este envío por uno anterior.
fr: À la fin de la soumission actuelle, remplacer la soumission actuelle par une soumission antérieure.
it: Alla fine dell'invio corrente, sostituisce l'invio corrente con uno precedente.
ja: 現在の送信の最後で、現在の送信を前の送信に置き換えます。
pl: Na końcu aktualnie wprowadzonych danych zastąp je poprzednio wprowadzonymi danymi.
pt_br: No final do envio atual, substitua o envio atual por um envio anterior.
ru: Замена текущей отправки на предыдущую в конце текущей отправки.
tr: Geçerli gönderimin sonunda, geçerli gönderimi önceki bir gönderimle değiştirin.
zh_hans: 在当前提交结束时，将当前提交替换为前一个提交。
zh_hant: 在目前提交的結尾，以上一個提交取代目前提交。

# UpArrowHelp2
source: Elsewhere, move the cursor up one line.
cs: Jinde přesune kurzor o jeden řádek nahoru.
de: Verschiebt andernfalls den Cursor eine Zeile nach oben.
es: En otras ubicaciones, suba el cursor una línea.
fr: Ailleurs, déplacer le curseur d'une ligne vers le haut.
it: Altrove, sposta il cursore alla riga precedente.
ja: 他の場所では、カーソルを 1 行上に移動します。
pl: W innym miejscu przenieś kursor w górę o jeden wiersz.
pt_br: Em outro lugar, mova o cursor uma linha para cima.
ru: В других случаях курсор перемещается на строку выше.
tr: Diğer yerlerde, imleci bir satır yukarı taşıyın.
zh_hans: 在其他位置，将光标移到上一行。
zh_hant: 在其他地方，將資料指標向上移動一行。

source: Usage:
cs: Použití:
de: Nutzung:
es: Uso:
fr: Utilisation :
it: Utilizzo:
ja: 使用法:
pl: Użycie:
pt_br: Uso:
ru: Использование:
tr: Kullanım:
zh_hans: 使用情况:
zh_hant: 使用方式:

# WaitTitle
source: Copy
cs: Kopírovat
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ja: コピー
pl: Kopiuj
pt_br: Copiar
ru: Копировать
tr: Kopyala
zh_hans: 复制
zh_hant: 複製

# WaitMessage
source: Generating Rich Text Format representation from selection.
cs: Generuje se znázornění výběru ve formátu RTF.
de: Eine Darstellung im Rich Text-Format wird aus der Auswahl generiert.
es: Generando una representación con formato de texto enriquecido a partir de la selección.
fr: Génération d'une représentation RTF (Rich Text Format) de la sélection.
it: Generazione della rappresentazione Rich Text Format dalla selezione.
ja: 選択内容に基づいてリッチ テキスト形式表現を生成しています。
pl: Generowanie wyboru w postaci tekstu sformatowanego.
pt_br: Gerando representação de Formato Rich Text de uma seleção.
ru: Создание представления RTF из выделенных элементов.
tr: Seçimden Zengin Metin Biçimi gösterimi oluşturuluyor.
zh_hans: 基于选定内容生成 RTF 格式表示形式。
zh_hant: 從選取項目產生 RTF 格式表示法。

# Backspace
source: Delete Character To Left
cs: Odstranit znak nalevo
de: Zeichen links löschen
es: Eliminar carácter a la izquierda
fr: Supprimer le caractère à gauche
it: Elimina carattere a sinistra
ja: 左の文字を削除
pl: Usuń znak z lewej
pt_br: Excluir Caractere para Esquerda
ru: Удалить знак слева
tr: Sola Doğru Karakter Sil
zh_hans: 删除左侧字符
zh_hant: 刪除左邊的字元

# BreakLine
source: Insert New Line
cs: Vložit nový řádek
de: Neue Zeile einfügen
es: Insertar nueva línea
fr: Insérer une nouvelle ligne
it: Inserisci nuova riga
ja: 改行の挿入
pl: Wstaw nowy wiersz
pt_br: Inserir Nova Linha
ru: Вставить новую строку
tr: Yeni Satır Ekle
zh_hans: 插入新行
zh_hant: 插入新行

source: Paste
cs: Vložit
de: Einfügen
es: Pegar
fr: Coller
it: Incolla
ja: 貼り付け
pl: Wklej
pt_br: Colar
ru: Вставить
tr: Yapıştır
zh_hans: 粘贴
zh_hant: 貼上

# Cut
source: Cut Selection
cs: Vyjmout výběr
de: Auswahl ausschneiden
es: Cortar selección
fr: Couper la sélection
it: Taglia selezione
ja: 選択部分を削除
pl: Wytnij zaznaczenie
pt_br: Cortar Seleção
ru: Вырезать выделенный фрагмент
tr: Seçimi Kes
zh_hans: 剪切选定内容
zh_hant: 剪下選取範圍

# Delete
source: Delete Text
cs: Odstranit text
de: Text löschen
es: Eliminar texto
fr: Supprimer le texte
it: Elimina testo
ja: テキストの削除
pl: Usuń tekst
pt_br: Excluir Texto
ru: Удалить текст
tr: Metni Sil
zh_hans: 删除文本
zh_hant: 刪除文字

source: Cut Line
cs: Vyjmout řádek
de: Zeile ausschneiden
es: Cortar línea
fr: Couper la ligne
it: Taglia riga
ja: 行の切り取り
pl: Wytnij wiersz
pt_br: Recortar Linha
ru: Вырезать строку
tr: Satırı Kes
zh_hans: 剪切行
zh_hant: 剪下行

source: Delete Line
cs: Odstranit řádek
de: Zeile löschen
es: Eliminar línea
fr: Supprimer la ligne
it: Elimina riga
ja: 行の削除
pl: Usuń wiersz
pt_br: Excluir Linha
ru: Удалить строку
tr: Satırı Sil
zh_hans: 删除行
zh_hant: 刪除行

# TypeChar
source: Insert Text
cs: Vložit text
de: Text einfügen
es: Insertar texto
fr: Insérer du texte
it: Inserisci testo
ja: テキストの挿入
pl: Wstaw tekst
pt_br: Inserir Texto
ru: Вставить текст
tr: Metin Ekle
zh_hans: 插入文本
zh_hant: 插入文字

# CSVBScriptDirectives
source: Script directives:
cs: Direktivy skriptu:
de: Skriptdirektiven:
es: Directivas de script:
fr: Directives de script :
it: Direttive script:
ja: スクリプト ディレクティブ:
pl: Dyrektywy skryptu:
pt_br: Diretivas de script:
ru: Директивы скрипта:
tr: Betik yönergeleri:
zh_hans: 脚本指令:
zh_hant: 指令碼指示詞:

# RefHelp
source: Add a metadata reference to specified assembly and all its dependencies, e.g. #r "myLib.dll".
cs: Přidá odkazy metadat k určenému sestavení a všem jeho závislostem, třeba #r "myLib.dll".
de: Fügt der angegebenen Assembly und allen ihren Abhängigkeiten einen Metadatenverweis hinzu. Beispiel: #r "myLib.dll".
es: Agregue una referencia de metadatos al ensamblado especificado y todas sus dependencias, p. ej. #r "myLib.dll".
fr: Permet d'ajouter une référence de métadonnées à l'assembly spécifié et toutes ses dépendances. Exemple : #r "myLib.dll".
it: Aggiunge un riferimento ai metadati all'assembly specificato e a tutte le relative dipendenze, ad esempio #r "LibPersonale.dll".
ja: 指定されたアセンブリとそのすべての依存関係へのメタデータ参照を追加します (例: #r "myLib.dll")。
pl: Dodaj odwołanie do metadanych do określonego zestawu i wszystkich jego zależności, np. #r "myLib.dll".
pt_br: Adicione uma referência de metadados para o assembly especificado a todas as suas dependências, por ex., #r "myLib.dll".
ru: Добавьте ссылку на метаданные, чтобы указать сборку и все ее зависимости, например #r "myLib.dll".
tr: Belirtilen bütünleştirilmiş koda ve tüm bağımlılıklarına bir meta veri başvurusu ekleyin ör. #r "myLib.dll".
zh_hans: 添加对指定程序集及其所有依赖项的元数据引用，例如 #r "myLib.dll"。
zh_hant: 將中繼資料參考加入指定的組件及其所有相依性，例如 #r "myLib.dll"。

# LoadHelp
source: Load specified script file and execute it, e.g. #load "myScript.csx".
cs: Načte zadaný soubor skriptu a spustí ho, třeba #load "myScript.csx".
de: Lädt die angegebene Skriptdatei und führt sie aus. Beispiel: #load "myScript.csx".
es: Cargue el archivo de script especificado y ejecútelo, p. ej. #load "myScript.csx".
fr: Permet de charger le fichier de script spécifié et de l'exécuter. Exemple : #load "myScript.csx".
it: Carica il file di script specificato e lo esegue, ad esempio #load "ScriptPersonale.csx".
ja: 指定されたスクリプト ファイルを読み込んで実行します (例: #load "myScript.csx")。
pl: Załaduj określony plik skryptu i wykonaj go, np. #load "myScript.csx".
pt_br: Carregue um arquivo de script especificado e execute-o, por ex. #load "myScript.csx".
ru: Загрузите указанный файл скрипта и выполните его, например #load "myScript.csx".
tr: Belirtilen betik dosyasını yükleyip çalıştırın, ör. #load "myScript.csx".
zh_hans: 加载指定的脚本文件并执行，例如 #load "myScript.csx"。
zh_hant: 載入指定的指示碼檔案並加以執行，例如 #load "myScript.csx"。

# ErrorOutputFormatDefinitionDisplayName
source: Interactive Window Error Output
cs: Chybový výstup v interaktivním okně
de: Fehlerausgabe in interaktivem Fenster
es: Salida de error de ventana interactiva
fr: Sortie d'erreur de fenêtre interactive
it: Output dell'errore della finestra interattiva
ja: 対話型ウィンドウのエラー出力
pl: Dane wyjściowe błędu okna interakcyjnego
pt_br: Saída de erro da janela interativa
ru: Интерактивное окно вывода ошибок
tr: Etkileşimli Pencere Hata Çıktısı
zh_hans: 交互窗口错误输出
zh_hant: 互動式視窗錯誤輸出
