Repository: dotnet/interactive-window
Catalog: src/Microsoft.VisualStudio.InteractiveWindow/xlf/InteractiveWindowResources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# AlreadyInitialized
source: The interactive window has already been initialized.
cs: Interaktivní okno už je inicializované.
de: Das interaktive Fenster wurde bereits initialisiert.
es: La ventana interactiva ya se inicializó.
fr: La fenêtre interactive a déjà été initialisée.
it: La finestra interattiva è già stata inizializzata.
ja: 対話型ウィンドウは既に初期化されています。
pl: Okno interaktywne zostało już zainicjowane.
pt_br: A janela interativa já foi inicializada.
ru: Интерактивное окно уже было инициализировано.
tr: Etkileşimli pencere daha önce başlatıldı.
zh_hans: 交互窗口已经初始化。
zh_hant: 已經初始化此互動式視窗。

# AltDownArrowHelp
source: Replace the current submission with a subsequent submission (after having previously navigated backwards).
cs: Nahradí aktuální odeslání následujícím odesláním (po předchozí navigaci směrem zpět).
de: Ersetzt die aktuelle Übermittlung durch eine nachfolgende Übermittlung (nach vorheriger Rückwärtsnavigation).
es: Reemplace el envío actual por uno posterior (tras haber navegado hacia atrás).
fr: Remplacer la soumission actuelle par une soumission ultérieure (après avoir navigué vers l'arrière).
it: Sostituisce l'invio corrente con uno successivo dopo che è stato eseguito uno spostamento all'indietro.
ja: 現在の送信を次の送信に置き換えます (前に戻っている場合)。
pl: Zastąp aktualnie wprowadzone dane kolejnymi danymi (po wcześniejszej nawigacji wstecz).
pt_br: Substitua o envio atual por um envio subsequente (após ter anteriormente navegado para trás).
ru: Замена текущей отправки на последующую (после предыдущего перехода в обратном порядке).
tr: Geçerli gönderimi sonraki bir gönderimle değiştir (daha önce geriye gittikten sonra).
zh_hans: 将当前提交替换为后一个提交(在之前已向后导航之后)。
zh_hant: 以下一個提交取代目前提交 (向後巡覽之後)。

# AltUpArrowHelp
source: Replace the current submission with a previous submission.
cs: Nahradí aktuální odeslání předchozím odesláním.
de: Ersetzt die aktuelle Übermittlung durch eine vorherige Übermittlung.
es: Reemplace el envío actual por uno anterior.
fr: Remplacer la soumission actuelle par une soumission antérieure.
it: Sostituisce l'invio corrente con uno precedente.
ja: 現在の送信を前の送信に置き換えます。
pl: Zastąp aktualnie wprowadzone dane danymi wprowadzonymi poprzednio.
pt_br: Substitua o envio atual por um envio anterior.
ru: Замена текущей отправки на предыдущую.
tr: Geçerli gönderimi önceki bir gönderimle değiştir.
zh_hans: 将当前提交替换为前一个提交。
zh_hant: 以上一個提交取代目前提交。

# ClearScreenCommandDescription
source: Clears the contents of the editor window, leaving history and execution context intact.
cs: Vymaže obsah okna editoru, ale historii a kontext provádění ponechá beze změny.
de: Löscht den Inhalt des Editor-Fensters. Verlauf und Ausführungskontext bleiben intakt.
es: Borra el contenido de la ventana del editor, pero deja intactos el historial y el contexto de ejecución.
fr: Efface le contenu de la fenêtre de l'éditeur, en laissant l'historique et le contexte d'exécution intacts.
it: Cancella il contenuto della finestra dell'editor, lasciando intatte la cronologia e il contesto di esecuzione.
ja: 編集ウィンドウの内容をクリアし、履歴と実行コンテキストはそのまま保持します。
pl: Czyści zawartość okna edytora, pozostawiając historię i kontekst wykonania bez zmian.
pt_br: Limpa o conteúdo da janela do editor, deixando intactos o contexto de execução e o histórico.
ru: Удаление содержимого окна редактирования, не затрагивая журнал и контекст выполнения.
tr: Geçmişe ve yürütme bağlamına dokunmadan düzenleyici penceresinin içeriğini siler.
zh_hans: 清除编辑器窗口中的内容，保留历史记录和执行上下文不变。
zh_hant: 清除編輯器視窗的內容，保持記錄及執行內容不變。

# CommandFailed
source: Command '{0}' failed: {1}
cs: Neúspěšný příkaz {0}: {1}
de: Fehler beim Befehl "{0}": {1}
es: Error del comando "{0}": {1}
fr: Échec de la commande '{0}' : {1}
it: Il comando '{0}' non è riuscito: {1}
ja: コマンド '{0}' に失敗しました: {1}
pl: Polecenie „{0}” nie powiodło się: {1}
pt_br: Falha no comando '{0}': {1}
ru: Команда "{0}" не выполнена: {1}
tr: '{0}' komutu başarısız oldu: {1}
zh_hans: 命令“{0}”失败: {1}
zh_hant: 命令 '{0}' 失敗: {1}

# CommandNamePlaceholder
source: [command-name]
cs: [název-příkazu]
de: [Befehlsname]
es: [nombre-comando]
fr: [nom-commande]
it: [nome-comando]
ja: [コマンド名]
pl: [nazwa-polecenia]
ru: [имя_команды]
tr: [komut-adı]
zh_hant: [命令名稱]

# CtrlAHelp
source: First press, select the submission containing the cursor. Second press, select all text in the window.
cs: Prvním stisknutím vyberete odeslání obsahující kurzor. Druhým stisknutím vyberete veškerý text v okně.
de: Beim ersten Drücken der Taste wird die Übermittlung ausgewählt, die den Cursor enthält. Beim zweiten Drücken der Taste wird der gesamte Text im Fenster ausgewählt.
es: Al presionar por primera vez, se selecciona el envío que contiene el cursor. Al presionar por segunda vez, se selecciona todo el texto de la ventana.
fr: Premier appui, sélectionner la soumission contenant le curseur. Deuxième appui, sélectionner tout le texte de la fenêtre.
it: Se premuto una volta, seleziona l'invio che contiene il cursore. Se premuto la seconda volta, seleziona tutto i testo nella finestra.
ja: 最初に押すと、カーソルの置かれた送信が選択されます。もう一度押すと、ウィンドウ内のすべてのテキストが選択されます。
pl: Pierwsze naciśnięcie wybiera wprowadzone dane zawierające kursor. Drugie naciśnięcie zaznacza cały tekst w oknie.
pt_br: Ao pressionar pela primeira vez, selecione o envio que contém o cursor. Ao pressionar pela segunda vez, selecione todo o texto na janela.
ru: Первое нажатие выделяет отправку, в которой находится курсор. Второе нажатие выделяет весь текст в окне.
tr: İlk basmada imleci içeren gönderimi seçer. İkinci basmada penceredeki tüm metni seçer.
zh_hans: 第一次按下时，选择包含光标的提交，第二次按下时，选择窗口中的所有文本。
zh_hant: 首先選取包含資料指標的提交。接著選取視窗中所有文字。

# CtrlAltDownArrowHelp
source: Replace the current submission with a subsequent submission beginning with the same text (after having previously navigated backwards).
cs: Nahradí aktuální odeslání následujícím odesláním, které začíná stejným textem (po předchozí navigaci směrem zpět).
de: Ersetzt die aktuelle Übermittlung durch eine nachfolgende Übermittlung mit dem gleichen Text (nach vorheriger Rückwärtsnavigation).
es: Reemplace el envío actual por uno posterior con el mismo texto inicial (tras haber navegado hacia atrás).
fr: Remplacer la soumission actuelle par une soumission ultérieure commençant par le même texte (après avoir navigué vers l'arrière).
it: Sostituisce l'invio corrente con uno successivo, a partire dallo stesso testo, dopo che è stato eseguito uno spostamento all'indietro.
ja: 現在の送信を、同じテキストで始まる次の送信に置き換えます (前に戻っている場合)。
pl: Zastąp aktualnie wprowadzone dane kolejnymi wprowadzonymi danymi rozpoczynającymi się od tego samego tekstu (po wcześniejszej nawigacji wstecz).
pt_br: Substitua o envio atual por um envio subsequente começando com o mesmo texto (após ter anteriormente navegado para trás).
ru: Замена текущей отправки на последующую, начинающуюся с того же текста (после предыдущего перехода в обратном порядке).
tr: Geçerli gönderimi aynı metinle başlayan sonraki bir gönderimle değiştir (daha önce geriye gittikten sonra).
zh_hans: 将当前提交替换为以相同文本开头的后一个提交(在之前已向后导航之后)。
zh_hant: 以開頭文字相同的下一個提交取代目前提交 (向後巡覽之後)。

# CtrlAltUpArrowHelp
source: Replace the current submission with a previous submission beginning with the same text.
cs: Nahradí aktuální odeslání předchozím odesláním, které začíná stejným textem.
de: Ersetzt die aktuelle Übermittlung durch eine vorherige Übermittlung, die mit dem gleichen Text beginnt.
es: Reemplace el envío actual por uno posterior con el mismo texto inicial.
fr: Remplacer la soumission actuelle par une soumission antérieure commençant par le même texte.
it: Sostituisce l'invio corrente con uno precedente, a partire dallo stesso testo.
ja: 現在の送信を、同じテキストで始まる前の送信に置き換えます。
pl: Zastąp aktualnie wprowadzone dane poprzednio wprowadzonymi danymi rozpoczynającymi się od tego samego tekstu.
pt_br: Substitua o envio atual por um envio anterior começando com o mesmo texto.
ru: Замена текущей отправки на предыдущую, начинающуюся с того же текста.
tr: Geçerli gönderimi aynı metinle başlayan önceki bir gönderimle değiştir.
zh_hans: 将当前提交替换为以相同文本开头的前一个提交。
zh_hant: 以開頭文字相同的上一個提交取代目前提交。

# CtrlECtrlEnterHelp
source: Paste and execute the selection before any pending input in the interactive buffer.
cs: Vloží a provede výběr před jakýmkoli čekajícím vstupem v interaktivní vyrovnávací paměti.
de: Fügt die Auswahl vor allen ausstehenden Eingaben im interaktiven Puffer ein und führt sie aus.
es: Pegue la selección y ejecútela antes de cualquier entrada pendiente en el búfer interactivo.
fr: Coller et exécuter la sélection avant les entrées en attente dans la mémoire tampon interactive.
it: Incolla ed esegue la selezione prima di eventuale input in sospeso nel buffer interattivo.
ja: 対話型バッファー内の保留中の入力の前に、選択内容を貼り付けて実行します。
pl: Wklej i wykonaj zaznaczenie przed wszystkimi oczekującymi danymi wejściowymi w buforze interaktywnym.
pt_br: Cole e execute a seleção antes de qualquer entrada pendente no buffer interativo.
ru: Вставка и выполнение выбранного перед любым ожидающим вводом в интерактивном буфере.
tr: Etkileşimli arabellekte bekleyen girişlerden önce seçimi yapıştırın ve yürütün.
zh_hans: 粘贴选定内容，并在交互式缓冲中任何挂起的输入之前执行。
zh_hant: 在互動式緩衝區中任一暫止輸入之前貼上選取項目，並加以執行。

# CtrlEnterHelp1
source: Within the current submission, evaluate the current submission.
cs: Vyhodnotí aktuální odeslání v rámci tohoto odeslání.
de: Wertet die aktuelle Übermittlung innerhalb der aktuellen Übermittlung aus.
es: Evalúe el envío actual dentro del propio envío.
fr: Dans la soumission actuelle, évaluer la soumission actuelle.
it: Nell'invio corrente, valuta l'invio.
ja: 現在の送信内で、現在の送信を評価します。
pl: Oceń aktualnie wprowadzone dane w ich ramach.
pt_br: Dentro do envio atual, avalie esse envio.
ru: Вычисление текущей отправки в рамках текущей отправки.
tr: Geçerli gönderim içinde, geçerli gönderimi değerlendirin.
zh_hans: 在当前提交内，对当前提交求值。
zh_hant: 在目前提交中，評估目前提交。

# CtrlEnterHelp2
source: Within a previous submission, append the previous submission to the current submission.
cs: Připojí předchozí odeslání k aktuálnímu odeslání v rámci předchozího odeslání.
de: Fügt innerhalb einer vorherigen Übermittlung die vorherige Übermittlung an die aktuelle Übermittlung an.
es: Dentro de un envío anterior, asocie dicho envío al actual.
fr: Dans une soumission antérieure, ajouter la soumission antérieure à la soumission actuelle.
it: In un invio precedente, aggiunge l'invio precedente a quello corrente.
ja: 前の送信内で、前の送信を現在の送信に追加します。
pl: W ramach poprzednio wprowadzonych danych dołącz poprzednio wprowadzone dane do aktualnie wprowadzonych danych.
pt_br: Em um envio anterior, acrescente o envio anterior ao envio atual.
ru: Добавление предыдущей отправки к текущей в рамках предыдущей отправки.
tr: Önceki bir gönderim içinde, önceki gönderimi geçerli gönderime ekleyin.
zh_hans: 在前一个提交内，将前一个提交追加到当前提交。
zh_hant: 在上一個提交中，將上一個提交附加至目前提交。

# CtrlKCtrlEnterHelp
source: Paste the selection at the end of interactive buffer, leave caret at the end of input.
cs: Vloží výběr na konec interaktivní vyrovnávací paměti, ponechá stříšku na konci vstupu.
de: Fügt die Auswahl am Ende des interaktiven Puffers ein und belässt den Textcursor am Ende der Eingabe.
es: Pegue la selección al final del búfer interactivo y deje un símbolo de intercalación al final de la entrada.
fr: Coller la sélection à la fin de la mémoire tampon interactive, laisser le signe insertion à la fin de l'entrée.
it: Incolla la selezione alla fine del buffer interattivo, lasciando il punto di inserimento alla fine dell'input.
ja: 対話型バッファーの最後に選択内容を貼り付け、キャレットを入力の末尾に付けます。
pl: Wklej zaznaczenie na końcu buforu interaktywnego, pozostawiając karetkę na końcu danych wejściowych.
pt_br: Cole a seleção no final do buffer interativo, deixe um sinal de interpolação no final da entrada.
ru: Вставка выбранного в конец интерактивного буфера, при этом курсор остается в конце ввода.
tr: Etkileşimli arabelleğin sonunda seçimi yapıştırın, girişin sonuna bir şapka işareti koyun.
zh_hans: 在交互式缓冲区末尾粘贴选定内容，将插入点置于输入末尾。
zh_hant: 在互動式緩衝區的結尾貼上選取項目，將插入號保留在輸入的結尾。

# DownArrowHelp1
source: At the end of the current submission, replace the current submission with a subsequent submission (after having previously navigated backwards).
cs: Na konci aktuálního odeslání nahradí aktuální odeslání následujícím odesláním (po předchozí navigaci směrem zpět).
de: Ersetzt am Ende der aktuellen Übermittlung die aktuelle Übermittlung durch eine nachfolgende Übermittlung (nach vorheriger Rückwärtsnavigation).
es: Al final del envío actual, reemplace el envío actual por uno posterior (tras haber navegado hacia atrás).
fr: À la fin de la soumission actuelle, remplacer la soumission actuelle par une soumission ultérieure (après avoir navigué vers l'arrière).
it: Alla fine dell'invio corrente, sostituisce l'invio corrente con uno successivo dopo che è stato eseguito uno spostamento all'indietro.
ja: 現在の送信の最後で、現在の送信を次の送信に置き換えます (前に戻っている場合)。
pl: Na końcu aktualnie wprowadzonych danych zastąp je kolejno wprowadzonymi danymi (po wcześniejszej nawigacji wstecz).
pt_br: No final do envio atual, substitua o envio atual por um envio subsequente (após ter anteriormente navegado para trás).
ru: Замена текущей отправки на последующую в конце текущей отправки (после предыдущего перехода в обратном порядке).
tr: Geçerli gönderimin sonunda, geçerli gönderimi sonraki bir gönderimle değiştirin (daha önce geriye gittikten sonra).
zh_hans: 在当前提交结束时，将当前提交替换为后一个提交(在之前已向后导航之后)。
zh_hant: 在目前提交的結尾，以下一個提交取代目前提交 (向後巡覽之後)。

# DownArrowHelp2
source: Elsewhere, move the cursor down one line.
cs: Jinde přesune kurzor o jeden řádek dolů.
de: Verschiebt andernfalls den Cursor eine Zeile nach unten.
es: En otras ubicaciones, baje el cursor una línea.
fr: Ailleurs, déplacer le curseur d'une ligne vers le bas.
it: Altrove, sposta il cursore alla riga successiva.
ja: 他の場所では、カーソルを 1 行下に移動します。
pl: W innym miejscu przenieś kursor w dół o jeden wiersz.
pt_br: Em outro lugar, mova o cursor uma linha para baixo.
ru: В других случаях курсор перемещается на строку ниже.
tr: Diğer yerlerde, imleci bir satır aşağı taşıyın.
zh_hans: 在其他位置，将光标移到下一行。
zh_hant: 在其他地方，將資料指標向下移動一行。

# DuplicateCommand
source: A command with the name '{0}' has already been registered.
cs: Příkaz s názvem {0} už je zaregistrovaný.
de: Ein Befehl mit dem Namen '{0}' wurde bereits registriert.
es: Ya se registró un comando con el nombre '{0}'.
fr: Une commande avec le nom '{0}' a déjà été inscrite.
it: È stato già registrato un comando denominato '{0}'.
ja: '{0}' という名前のコマンドは既に登録されています。
pl: Polecenie o nazwie „{0}” zostało już zarejestrowane.
pt_br: Um comando com o nome "{0}" já foi registrado.
ru: Команда с именем "{0}" уже зарегистрирована.
tr: '{0}' adlı bir komut daha önce kaydedildi.
zh_hans: 名为“{0}”的命令已经注册。
zh_hant: 已有名為 '{0}' 的命令註冊。

# EnterHelp
source: If the current submission appears to be complete, evaluate it. Otherwise, insert a new line.
cs: Pokud se aktuální odeslání jeví jako kompletní, vyhodnotí ho. Jinak vloží nový řádek.
de: Wertet die aktuelle Übermittlung aus, wenn diese abgeschlossen zu sein scheint. Fügt andernfalls eine neue Zeile ein.
es: Si el envío actual parece estar completo, evalúelo. De lo contrario, inserte una nueva línea.
fr: Si la soumission actuelle semble être terminée, l'évaluer. Sinon, insérer une nouvelle ligne.
it: Valuta l'invio corrente se sembra completo; in caso contrario, inserisce una nuova riga.
ja: 現在の送信が完了している場合は、評価します。完了していない場合には、新しい行を挿入します。
pl: Jeśli aktualnie wprowadzane dane są kompletne, przeprowadź ich ocenę. W przeciwnym razie wstaw nowy wiersz.
pt_br: Se o envio atual parece estar completo, avalie-o. Caso contrário, insira uma nova linha.
ru: Вычисление текущей отправки, если она выполнена. В противном случае вставляет новую строку.
tr: Geçerli gönderim tamamlanmış görünüyorsa değerlendirin. Aksi takdirde, yeni bir satır ekleyin.
zh_hans: 如果显示当前提交完成，则对其进行求值。否则，插入新行。
zh_hant: 如果目前提交似乎已完成，會加以評估。否則會插入新行。

# EscapeHelp
source: Clear the current submission.
cs: Vymaže aktuální odeslání.
de: Löscht die aktuelle Übermittlung.
es: Borre el envío actual.
fr: Effacer la soumission actuelle.
it: Cancella l'invio corrente.
ja: 現在の送信をクリアします。
pl: Wyczyść aktualnie wprowadzone dane.
pt_br: Limpe o envio atual.
ru: Удаление текущей отправки.
tr: Geçerli gönderimi silin.
zh_hans: 清除当前提交。
zh_hant: 清除目前提交。

# HelpCommandDescription
source: Display help on specified command, or all available commands and key bindings if none specified.
cs: Zobrazí nápovědu pro zadaný příkaz nebo (pokud není žádný zadaný) pro všechny dostupné příkazy a klíčové vazby.
de: Zeigt Hilfe zum angegebenen Befehl oder zu allen verfügbaren Befehlen und Tastenzuordnungen an, wenn kein Befehl angegeben wird.
es: Muestra ayuda sobre el comando especificado o sobre todos los comandos y enlaces de teclado disponibles si no se especifica ninguno.
fr: Afficher de l'aide sur la commande spécifiée ou sur toutes les commandes disponibles et les combinaisons de touches si rien n'est spécifié.
it: Visualizza la guida relativa al comando specificato oppure tutti i comandi e i tasti di scelta rapida disponibili se non viene specificato alcun comando.
ja: 指定のコマンド、または指定していない場合には利用可能なすべてのコマンドとキー バイデンィングに関する、ヘルプを表示します。
pl: Wyświetl pomoc dla określonego polecenia lub wszystkich dostępnych poleceń i powiązań klawiszy, jeśli polecenie nie zostanie podane.
pt_br: Exiba a ajuda sobre o comando especificado, ou todas as associações de tecla e comandos disponíveis, se não houver nenhum especificado.
ru: Отображение справки по выбранной команде или по всем доступным командам и сочетаниям клавиш, если конкретная команда не указана.
tr: Belirtilen komutla veya hiçbiri belirtilmemişse tüm kullanılabilir komutlarla ve anahtar bağlamalarıyla ilgili yardımı görüntüleyin.
zh_hans: 显示有关指定命令的帮助，如果未指定，则显示有关所有可用命令和密钥绑定的帮助。
zh_hant: 顯示指定命令的說明，若未指定則顯示所有可用命令與索引鍵繫結。

# InternalError
source: An internal error has occurred in the Interactive window. Please restart Visual Studio.
cs: V okně Interactive došlo k vnitřní chybě. Restartujte prosím sadu Visual Studio.
de: Interner Fehler im interaktiven Fenster. Bitte starten Sie Visual Studio neu.
es: Error interno en la ventana interactiva. Reinicie Visual Studio.
fr: Une erreur interne s'est produite dans la fenêtre Interactive. Redémarrez Visual Studio.
it: Si è verificato un errore interno nella finestra interattiva. Riavviare Visual Studio.
ja: 対話型のウィンドウで内部エラーが発生しました。Visual Studio を再起動してください。
pl: W oknie interaktywnym wystąpił błąd wewnętrzny. Uruchom ponownie program Visual Studio.
pt_br: Erro interno na janela interativa. Reinicie o Visual Studio.
ru: В Интерактивном окне произошла внутренняя ошибка. Перезапустите Visual Studio.
tr: Interactive penceresinde bir iç hata oluştu. Lütfen Visual Studio'yu yeniden başlatın.
zh_hans: 交互窗口中发生内部错误。请重启 Visual Studio。
zh_hant: Interactive 視窗中發生內部錯誤。 請重新啟動 Visual Studio。

source: Keyboard shortcuts:
cs: Klávesové zkratky:
de: Tastaturkurzbefehle:
es: Métodos abreviados de teclado:
fr: Raccourcis clavier :
it: Tasti di scelta rapida:
ja: キーボード ショートカット:
pl: Skróty klawiaturowe:
pt_br: Atalhos de teclado:
ru: Сочетания клавиш:
tr: Klavye kısayolları:
zh_hans: 键盘快捷方式:
zh_hant: 鍵盤快速鍵:

# MissingCommandName
source: The command of type '{0}' has no command names.
cs: Příkaz typu {0} nemá žádný název příkazu.
de: Der Befehl vom Typ '{0}' hat keine Befehlsnamen.
es: El comando de tipo "{0}" no tiene nombres de comando.
fr: La commande de type '{0}' n'a aucun nom de commande.
it: Il comando di tipo '{0}' non contiene nomi di comando.
ja: コマンドの型 '{0}' にコマンド名がありません。
pl: Polecenie typu „{0}” nie ma nazw poleceń.
pt_br: O comando do tipo "{0}" não tem nomes de comando.
ru: Команда типа "{0}" не включает имена команд.
tr: '{0}' türündeki komutun komut adı yok.
zh_hans: “{0}”类型的命令没有命令名称。
zh_hant: 類型為 '{0}' 的命令沒有命令名稱。

# NotInitialized
source: The interactive window has not yet been initialized.
cs: Interaktivní okno se zatím neinicializovalo.
de: Das interaktive Fenster wurde noch nicht initialisiert.
es: La ventana interactiva aún no se inicializó.
fr: La fenêtre interactive n'est pas encore initialisée.
it: La finestra interattiva non è stata ancora inizializzata.
ja: 対話型のウィンドウはまだ初期化されていません。
pl: Okno interaktywne nie zostało jeszcze zainicjowane.
pt_br: A janela interativa ainda não foi inicializada.
ru: Интерактивное окно еще не инициализировано.
tr: Etkileşimli pencere henüz başlatılmadı.
zh_hans: 交互窗口尚未初始化。
zh_hant: 尚未初始化此互動式視窗。

# IsResetting
source: The interactive window is resetting.
cs: Interaktivní okno se přenastavuje.
de: Das interaktive Fenster wird zurückgesetzt.
es: La ventana interactiva se está restableciendo.
fr: La fenêtre interactive est en cours de réinitialisation.
it: È in corso la reimpostazione della finestra interattiva.
ja: 対話式ウィンドウをリセットしています。
pl: Trwa resetowanie okna interaktywnego.
pt_br: A janela interativa está reiniciando.
ru: Выполняется сброс Интерактивного окна.
tr: Etkileşimli pencere sıfırlanıyor.
zh_hans: 正在重置交互式窗口。
zh_hant: 正在重設互動式視窗。

source: Parameters:
cs: Parametry:
de: Parameter:
es: Parámetros:
fr: Paramètres :
it: Parametri:
ja: パラメーター:
pl: Parametry:
pt_br: Parâmetros:
ru: Параметры:
tr: Parametreler:
zh_hans: 参数:
zh_hant: 參數:

source: REPL commands:
cs: Příkazy REPL:
de: REPL-Befehle:
es: Comandos REPL:
fr: Commandes REPL :
it: Comandi REPL:
ja: REPL コマンド:
pl: Polecenia REPL:
pt_br: Comandos REPL:
ru: Команды цикла чтение-вычисление-печать (REPL):
tr: REPL komutları:
zh_hans: REPL 命令:
zh_hant: REPL 命令:

# RequireNonUIThread
source: This method may not be called on the UI thread (to avoid hangs).
cs: Tato metoda se nedá volat ve vlákně uživatelského rozhraní (aby nedošlo k zablokování).
de: Diese Methode kann nicht für den Benutzeroberflächenthread aufgerufen werden (um Stabilitätsprobleme zu vermeiden).
es: Es posible que no se pueda llamar a este método en el subproceso de interfaz de usuario (para evitar cuelgues).
fr: Cette méthode ne peut pas être appelée sur le thread d'interface utilisateur (pour éviter tout blocage).
it: È possibile non chiamare questo metodo sul thread dell'interfaccia utente (per evitare blocchi).
ja: このメソッドは UI スレッドで呼び出されない場合があります (ハング回避のため)。
pl: Tej metody nie można wywołać w wątku interfejsu użytkownika (w celu uniknięcia zawieszeń).
pt_br: Esse método pode não ser chamado no thread da interface do usuário (para evitar travamentos).
ru: Этот метод нельзя вызвать в потоке пользовательского интерфейса (во избежание зависаний).
tr: Bu metot UI iş parçacığında çağrılamaz (askıda kalmaları önlemek için).
zh_hans: 不可以在此 UI 线程上调用此方法 (以避免挂起)。
zh_hant: 此方法不能在 UI 執行緒上呼叫 (以免停止回應)。

# RequireUIThread
source: This method may only be called on the UI thread.
cs: Tato metoda se dá volat jenom ve vlákně uživatelského rozhraní.
de: Diese Methode kann nur für den Benutzeroberflächenthread aufgerufen werden.
es: Este método solo se puede llamar en el subproceso de interfaz de usuario.
fr: Cette méthode peut uniquement être appelée sur le thread d'interface utilisateur.
it: È possibile chiamare questo metodo solo sul thread dell'interfaccia utente.
ja: このメソッドは UI スレッド上でのみ呼び出される場合があります。
pl: Tę metodę można wywołać tylko w wątku interfejsu użytkownika.
pt_br: Esse método só pode ser chamado no thread da interface do usuário.
ru: Этот метод можно вызвать только в потоке пользовательского интерфейса.
tr: Bu metot yalnızca UI iş parçacığında çağrılabilir.
zh_hans: 只能在此 UI 线程上调用此方法。
zh_hant: 此方法只能在 UI 執行緒上呼叫。
